app/controllers/sessions_controller.rb

    def google_login
        client_id = ENV['google_client_id']
        client_secret = ENV['google_client_secret']
        access_token = params[:access_token]

        begin
            oauth_client = Google::Apis::Oauth2V2::Oauth2Service.new
            oauth_client.authorization = Google::Auth::UserRefreshCredentials.new(
                client_id: client_id,
                access_token: access_token
            )
            user_info = oauth_client.get_userinfo

            # Find or create user based on email
            user = User.find_or_create_by(email: user_info.email) do |u|
                u.full_name = user_info.name
                u.avatar_url = user_info.picture
                u.provider = 'google'
                u.password = SecureRandom.hex(8) # Set a random password
                # Set additional attributes based on your requirements
            end
            user.save()
---
INSERT INTO `users` (`full_name`, `avatar_url`, `provider`, `email`, `password`, `refresh_token`, `created_at`, `updated_at`) VALUES ('Đặng Anh Tuấn', 'https://lh3.googleusercontent.com/a/AAcHTtdIspA_aDFy6ag7HjnrAKszRiCAGCvuBzLeV7iToUv2xA=s96-c', 'google', 'tuanda2@vmogroup.com', '3433d4d2c3beb934', NULL, '2023-07-13 06:40:29.586908', '2023-07-13 06:40:29.586908')
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'toantt@vmogroup.com' LIMIT 1
UPDATE `users` SET `users`.`refresh_token` = 'bdb973a2ff67e5dd20d0e49ada1e902e9b5c062c44065be351bae6b67adc2703', `users`.`updated_at` = '2023-07-13 06:40:29.595126' WHERE `users`.`id` = 1

        def refresh_token
            refresh_token = params[:refresh_token]
            user = User.find_by(refresh_token: refresh_token)
---
SELECT `users`.* FROM `users` WHERE `users`.`refresh_token` = 'b5591cd3adf6a57b9afbce1d745780ac5d3736112aecee388190fbf5ef036c43' LIMIT 1

    def generate_refresh_token(user)
        # Generate a refresh token and store it in the database or other secure storage
        refresh_token = SecureRandom.hex(32)
        user.update(refresh_token: refresh_token)
---
UPDATE `users` SET `users`.`refresh_token` = '38a650220420ce0e29c572057af0d2c6863f8f398e91486e4f7f1beabf874e7a' WHERE `users`.`id` = 2